scarab/ref.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>補助ページ</title>
<!-- 2015-12-12 土 22:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Takehide Soh" />
<link rel="stylesheet" type="text/css" href="../../../myhome.css"/>
</head>
<body>
<div id="content">
<h1 class="title">補助ページ</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Scala について</a>
<ul>
<li><a href="#sec-1-1">REPL のオプション</a></li>
<li><a href="#sec-1-2">import 文の書き方</a></li>
<li><a href="#sec-1-3">(Scalaの) 変数の宣言</a></li>
<li><a href="#sec-1-4">print 文について</a></li>
<li><a href="#sec-1-5">for 文について</a></li>
<li><a href="#sec-1-6">値を返すfor（yield）</a></li>
<li><a href="#sec-1-7">関数定義</a></li>
<li><a href="#sec-1-8">コレクション</a></li>
<li><a href="#sec-1-9">map</a></li>
</ul>
</li>
</ul>
</div>
</div>

<style type="text/css">
#table1 th { background-color: #3B5998; color: white;
     border-style: solid; border-color: black; border-width: thin;
     border: none;}
#table1 td { background-color: #3B5998; color: white;
     border-style: solid; border-color: black; border-width: thin; border: none}
#table1 td+td { background-color: #eeeeee; color: black; width:500px}

h1#aa {
    border-color:#6576CC;
    border-width:4px 0px 4px 0px;
    margin-top:30px;
    margin-bottom:30px;
    padding-top:30px;
    padding-bottom:30px;
    padding-left:30px;
    border-style:solid;
    font-size:1.7em;
}
</style>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Scala について</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Scarab プログラムを書くのに最低限知っていたほうが良い，Scala の知識を以下に記載する．
</li>

<li>もっと詳細に知りたい方は以下などを参照してください．
<ul class="org-ul">
<li>日本語
<ul class="org-ul">
<li><a href="http://www.ne.jp/asahi/hishidama/home/tech/scala/">Scalaメモ(Hishidama&rsquo;s Scala Memo)</a>
<ul class="org-ul">
<li>辞書的に利用することができます．
</li>
</ul>
</li>
<li><a href="http://bach.istc.kobe-u.ac.jp/lect/ProLang/org/scala.html">Scalaプログラミング入門</a>
<ul class="org-ul">
<li>課題をこなしながら，Scala を基礎から勉強できます．
</li>
</ul>
</li>
<li><a href="http://kix.istc.kobe-u.ac.jp/~soh/prolang/GameOfLife.html">Scala でライフゲーム</a>
<ul class="org-ul">
<li>Scala で簡単なライフゲームのプログラムを作ります．
</li>
</ul>
</li>
<li><a href="http://kix.istc.kobe-u.ac.jp/~soh/prolang/Ticket.html">Scala で切符問題</a>
<ul class="org-ul">
<li>二分木や再帰を使って Scala で切符問題を解きます．
</li>
</ul>
</li>
</ul>
</li>
<li>英語
<ul class="org-ul">
<li>Scala 本家 (<a href="http://www.scala-lang.org">http://www.scala-lang.org</a>)
<ul class="org-ul">
<li>Documentation / Manuals / Translations に日本語のマニュアル等がある
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">REPL のオプション</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Scala の REPL のオプションは :help で表示できます．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; :help
All commands can be abbreviated, e.g., :he instead of :help.
:edit &lt;id&gt;|&lt;line&gt;        edit history
:help [command]          print <span style="color: #a020f0;">this</span> summary or command-specific help
:history [num]           show the history (optional num is commands to show)
:h? &lt;string&gt;             search the history
:imports [name name ...] show <span style="color: #a020f0;">import</span> history, identifying sources of names
:implicits [-v]          show the implicits in scope
:javap &lt;path|class&gt;      disassemble a file or <span style="color: #a020f0;">class</span> <span style="color: #228b22;">name</span>
:line &lt;id&gt;|&lt;line&gt;        place line(s) at the end of history
:load &lt;path&gt;             interpret lines in a file
:paste [-raw] [path]     enter paste mode or paste a file
:power                   enable power user mode
:quit                    exit the interpreter
:replay [options]        reset the repl and replay all previous commands
:require &lt;path&gt;          add a jar to the classpath
:reset [options]         reset the repl to its initial state, forgetting all session entries
:save &lt;path&gt;             save replayable session to a file
:sh &lt;command line&gt;       run a shell command (result is implicitly =&gt; List[String])
:settings &lt;options&gt;      update compiler options, <span style="color: #a020f0;">if</span> possible; see reset
:silent                  disable/enable automatic printing of results
:<span style="color: #a020f0;">type</span> [-v] &lt;expr&gt;        display the <span style="color: #a020f0;">type</span> <span style="color: #228b22;">of</span> an expression without evaluating it
:kind [-v] &lt;expr&gt;        display the kind of expression's <span style="color: #a020f0;">type</span>
:warnings                show the suppressed warnings from the most recent line which had any
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">import 文の書き方</h3>
<div class="outline-text-3" id="text-1-2">
<p>
いろいろな書き方ができます．
</p>
<ul class="org-ul">
<li>一番素直な書き方はフルパスを書く方法です．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab._
<span style="color: #a020f0;">import</span> jp.kobe_u.scarab.dsl._
</pre>
</div>
<ul class="org-ul">
<li>scala では相対 import ができ，以下のようにも書けます．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab._
<span style="color: #a020f0;">import</span> dsl._
</pre>
</div>
<ul class="org-ul">
<li>セミコロンで区切って一行で書けます．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab._ ; <span style="color: #a020f0;">import</span> dsl._
</pre>
</div>
<ul class="org-ul">
<li>カンマで区切ると import 文も省略できます．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala"><span style="color: #a020f0;">import</span> jp.kobe_u.scarab._, dsl._
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">(Scalaの) 変数の宣言</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>変数は，「var」によって宣言する．
<ul class="org-ul">
<li>変数は後から値の代入・変更が出来る
</li>
</ul>
</li>
<li>定数は，「val」によって宣言する．
<ul class="org-ul">
<li>定数は後から値の代入をすることが出来ない
</li>
</ul>
</li>
<li>&ldquo;a&rdquo; という定数を宣言してみる．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; <span style="color: #a020f0;">val</span> <span style="color: #a0522d;">a</span> = 1
a: Int = 1

scala&gt; a
res0: Int = 1
</pre>
</div>
<ul class="org-ul">
<li>&ldquo;a&rdquo; は定数なので再代入しようとするとエラーが出る．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; a = 3
&lt;console&gt;:8: error: reassignment to <span style="color: #a020f0;">val</span>
       a = 3
         ^
</pre>
</div>
<ul class="org-ul">
<li>&ldquo;b&rdquo; という変数を宣言してみる．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">b</span> = 1
b: Int = 1

scala&gt; b
res1: Int = 1
</pre>
</div>
<ul class="org-ul">
<li>&ldquo;b&rdquo; は変数なので再代入できる．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; b = 3
b: Int = 3

scala&gt; b
res2: Int = 3
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">print 文について</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>他の言語と同様に標準出力したいダブルクォーテーションで囲む
</li>
<li>print は改行なし，println は文字列の最後で改行する．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; print(<span style="color: #8b2252;">"Hello world"</span>)
Hello world
scala&gt; println(<span style="color: #8b2252;">"Hello world"</span>)
Hello world
</pre>
</div>
<ul class="org-ul">
<li>便利な機能として s&rdquo;&#x2026;&rdquo; とすることで変数を埋め込むことも可能
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; <span style="color: #a020f0;">val</span> <span style="color: #a0522d;">c</span> = 4
c: Int = 4

scala&gt; <span style="color: #a020f0;">val</span> <span style="color: #a0522d;">d</span> = 5
d: Int = 5

scala&gt; println(s<span style="color: #8b2252;">"c + d = ${c + d}"</span>)
c + d = 9
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">for 文について</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Scala の for 文は以下のように書ける
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; <span style="color: #a020f0;">for</span> (i &lt;- 1 to 3) println(i)
1
2
3
</pre>
</div>
<ul class="org-ul">
<li>セミコロンで区切れば2重のループも簡単に書ける
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; <span style="color: #a020f0;">for</span> (i &lt;- 1 to 3 ; j &lt;- 1 to 3) println(i,j)
(1,1)
(1,2)
...
(3,2)
(3,3)
</pre>
</div>
<ul class="org-ul">
<li>3以上の多重ループも同様
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; <span style="color: #a020f0;">for</span> (i &lt;- 1 to 3 ; j &lt;- 1 to 3 ; k &lt;- 1 to 3) println(i,j,k)
(1,1,1)
(1,1,2)
...
(3,3,2)
(3,3,3)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">値を返すfor（yield）</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>基本的なfor式では戻り値は無いが，yieldを付けることによって，繰り返した本体の演算結果を返すことが出来る.
</li>
<li>繰り返された本体の計算結果がList等のコレクションに順番に入れられて返ってくる．
<ul class="org-ul">
<li>Scala のコレクションについての詳細は <a href="http://www.ne.jp/asahi/hishidama/home/tech/scala/collection/index.html">こちら</a>．
</li>
</ul>
</li>
<li>以下では 1 から 5 の整数がコレクション Vector に入れられて返っている．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; <span style="color: #a020f0;">for</span> (i &lt;- 1 to 5) <span style="color: #a020f0;">yield</span> i
res5: scala.collection.immutable.IndexedSeq[Int] = Vector(1, 2, 3, 4, 5)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">関数定義</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Scalaで関数 (function)を定義する．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">inc</span>(<span style="color: #a0522d;">x</span>: <span style="color: #228b22;">Int</span>): <span style="color: #228b22;">Int </span>= x + 1
inc: (x: Int)Int
</pre>
</div>
<ul class="org-ul">
<li>「inc」が関数名，「x: Int」が引数名とそのデータ型， その右の「Int」が返り値のデータ型， 「=」の右の「x + 1」が関数定義本体になる．
</li>
<li>定義した関数を使うには以下のようにする．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; inc(1)
res6: Int = 2

scala&gt; inc(inc(1))
res7: Int = 3
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">コレクション</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Scalaにはリストを始め，コレクションと呼ばれるさまざまなデータ構造が用意されている． 
</li>
<li>代表的なものは Seq，Map，Set である. (Scala では Array や List は Seq から派生している).
</li>
<li>以下のように使える．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; Seq(1,2,3)
res10: Seq[Int] = List(1, 2, 3)

scala&gt; <span style="color: #a020f0;">val</span> <span style="color: #a0522d;">s</span> = Seq(1,2,3)
s: Seq[Int] = List(1, 2, 3)

scala&gt; s.size
res11: Int = 3

scala&gt; s.head
res12: Int = 1

scala&gt; s.tail
res13: Seq[Int] = List(2, 3)
</pre>
</div>
<ul class="org-ul">
<li>ここで s. と入力してタブキーを押せば，s が持つメソッドが表示される．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; s.
++             canEqual        diff        fold              indexOfSlice         lastIndexOf        mkString       reduceLeftOption    scanRight       stringPrefix   toIterator      unzip3         
++:            collect         distinct    foldLeft          indexWhere           lastIndexOfSlice   nonEmpty       reduceOption        segmentLength   sum            toList          updated        
+:             collectFirst    drop        foldRight         indices              lastIndexWhere     orElse         reduceRight         seq             tail           toMap           view           
/:             combinations    dropRight   forall            init                 lastOption         padTo          reduceRightOption   size            tails          toSeq           withFilter     
:+             companion       dropWhile   foreach           inits                length             par            repr                slice           take           toSet           zip            
:\             compose         endsWith    genericBuilder    intersect            lengthCompare      partition      reverse             sliding         takeRight      toStream        zipAll         
addString      contains        exists      groupBy           isDefinedAt          lift               patch          reverseIterator     sortBy          takeWhile      toString        zipWithIndex   
aggregate      containsSlice   filter      grouped           isEmpty              map                permutations   reverseMap          sortWith        to             toTraversable                  
andThen        copyToArray     filterNot   hasDefiniteSize   isInstanceOf         max                prefixLength   runWith             sorted          toArray        toVector                       
apply          copyToBuffer    find        head              isTraversableAgain   maxBy              product        sameElements        span            toBuffer       transpose                      
applyOrElse    corresponds     flatMap     headOption        iterator             min                reduce         scan                splitAt         toIndexedSeq   union                          
asInstanceOf   count           flatten     indexOf           last                 minBy              reduceLeft     scanLeft            startsWith      toIterable     unzip
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">map</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Scalaでは， リストの要素に関数 (function)を適用した新しいリストを求めることなどが簡単に行える．
</li>
<li>リストの各要素に関数を適用するにはmapを用いる．
</li>
<li>以下では map により 1, 2, 3 という入力リストに対し 2, 3, 4 というリストが返されている．
</li>
</ul>
<div class="org-src-container">

<pre class="src src-scala">scala&gt; Seq(1,2,3).map(i =&gt; i + 1)
res9: Seq[Int] = List(2, 3, 4)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Takehide Soh</p>
<p class="date">Created: 2015-12-12 土 22:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
